Repository: egrischenkov/blog
Catalog: lib/core/l10n/app_*.arb
Languages: ru

# homeTitle
source: Egor Grischenkov's BLOG
ru: Блог Егора Грищенкова

# homeTabTitle
source: HOME
ru: ГЛАВНАЯ

# aboutTabTitle
source: ABOUT
ru: ОБО МНЕ

# contentTabTitle
source: CONTENT
ru: КОНТЕНТ

# settingsTitle
source: Settings
ru: Настройки

# settingsAppearanceTitle
source: Appearance
ru: Тема

# settingsAppearanceSubtitle
source: Adjust the colors to reduce glare and give your eyes a break
ru: Регулируйте тему, чтобы уменьшить блики и дать глазам отдохнуть

# settingsAppearanceSystemTheme
source: Use System Theme
ru: Использовать системную тему

# settingsAppearanceLightTheme
source: Light Theme
ru: Светлая тема

# settingsAppearanceDarkTheme
source: Dark Theme
ru: Темная тема

# settingsLanguageTitle
source: Language
ru: Язык

# homeSectionGreating
source: HELLO, I'M
ru: Йоу, я -

# homeSectionName
source: EGOR
ru: Егор

# homeSectionSurname
source: GRISCHENKOV
ru: Грищенков

# homeSectionSelfDescription
source: Flutter enthusiast and passionate martial arts aficionado
ru: Любитель Flutter и страстный ценитель боевых искусств

# aboutSectionTitle
source: About me
ru: Немного обо мне

# aboutSectionGreetings
source: Welcome to my blog, dear readers!
ru: Приветствую вас на моем блоге, дорогие читатели!

# aboutSectionMyself
source: My name is Egor Grischenkov, a Flutter developer with three years of experience and a passion for creating innovative mobile applications.
ru: Меня зовут Егор Грищенков, я Flutter-разработчик. Мой путь в мире разработки привел меня через две потрясающие компании - WhisperArts и Surf.

# aboutSectionWork
source: My journey in the development world has taken me through two fascinating companies - WhisperArts and Surf. At WhisperArts, I delved into building projects from the ground up, gaining valuable experience in the full development cycle. However, a particularly noteworthy chapter was my time at Surf. Here, I not only worked on projects but also shared my knowledge with students through a Flutter development course. Reviewing homework assignments and conducting code reviews became integral parts of my role.
ru: В WhisperArts я углубился в создание проектов с нуля, что придало мне ценный опыт в полном цикле разработки. Однако, особенно ярким моментом стала моя работа в Surf. Здесь я не только занимался проектами, но и передавал свои знания студентам в рамках курса по Flutter-разработке. Проверка домашних заданий и код-ревью стали неотъемлемой частью моей деятельности.

# aboutSectionHobby
source: Outside of work, I am passionately involved in martial arts. In the world of technology, I am drawn not only to practical aspects but also to the opportunity to share knowledge. My love for writing articles on technical topics has become another way for me to express myself in this information space.
ru: Вне работы я страстно увлечен единоборствами. В мире технологий меня привлекают не только практические аспекты, но и возможность делиться знаниями. Любовь к написанию статей на технические темы стала еще одним способом выражения себя в этом космосе информации.

# aboutSectionEnding
source: My life philosophy is infused with stoicism, and I strive to adhere to its principles in all aspects of my activities. In this blog, I intend to share my experiences, knowledge, and inspiration, hoping to encourage you to embark on your own creative endeavors in the development world. Thank you for joining me on this exciting journey!
ru: Моя философия жизни пронизана стоицизмом, и я стараюсь придерживаться его принципов в любых сферах своей деятельности. В этом блоге я намерен делиться своим опытом, знаниями и вдохновением, надеясь вдохновить вас на свои собственные творческие подвиги в мире разработки. Спасибо, что присоединились ко мне в этом захватывающем путешествии!

# contentSectionToday
source: Today
ru: Сегодня

# contentSectionYearsAgo
source: {count, plural, =1 {1 year ago} other {{count} years ago}}
ru: {count, plural, =1 {1 год назад} few {{count} года назад} many {{count} лет назад} other {{count} лет назад}}

# contentSectionMonthsAgo
source: {count, plural, =1 {1 month ago} other {{count} months ago}}
ru: {count, plural, =1 {1 месяц назад} few {{count} месяца назад} many {{count} месяцев назад} other {{count} месяцев назад}}

# contentSectionDaysAgo
source: {count, plural, =1 {1 day ago} other {{count} days ago}}
ru: {count, plural, =1 {1 день назад} few {{count} дня назад} many {{count} дней назад} other {{count} дней назад}}

# contentSectionHoursAgo
source: {count, plural, =1 {1 hour ago} other {{count} hours ago}}
ru: {count, plural, =1 {1 час назад} few {{count} часа назад} many {{count} часов назад} other {{count} часов назад}}

# contentSectionMinutesAgo
source: {count, plural, =1 {1 minute ago} other {{count} minutes ago}}
ru: {count, plural, =1 {1 минут назад} few {{count} минуты назад} many {{count} минут назад} other {{count} минут назад}}
